frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32L0xx/APM32L08x.svd
                <register>
                    <name>CALFAC</name>
                    <displayName>CALFAC</displayName>
                    <description>ADC Calibration factor</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALFAC</name>
                            <description>Calibration factor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCFG</name>
                    <displayName>CCFG</displayName>
                    <description>ADC common configuration
          register</description>
                    <addressOffset>0x308</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PSCSEL</name>
                            <description>ADC prescaler</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>VREFEN</name>
                            <description>VREFINT enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSEN</name>
                            <description>Temperature sensor enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LFMEN</name>
                            <description>Low Frequency Mode enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>COMP</name>
            <description>Comparator</description>
            <groupName>COMP</groupName>
            <baseAddress>0x40010018</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>COMP1_CSTS</name>
                    <displayName>COMP1_CSTS</displayName>
                    <description>Comparator 1 control and status
          register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EN1</name>
                            <description>Comparator 1 enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INMCCFG1</name>
                            <description>Comparator 1 Input Minus connection
              configuration bit</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WMODESEL1</name>
                            <description>Comparator 1 window mode selection
              bit</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPTMRIN1_1</name>
                            <description>COMP1 output select</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POLCFG1</name>
                            <description>Comparator 1 polarity selection
              bit</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTVAL1</name>
                            <description>Comparator 1 output status
              bit</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOCK1</name>
                            <description>COMP1_CSR register lock
              bit</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_CSTS</name>
                    <displayName>COMP2_CSTS</displayName>
                    <description>Comparator 2 control and status
          register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>LOCK2</name>
                            <description>COMP2_CSTS Register Lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OUTVAL2</name>
                            <description>Comparator 2 Output Status</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>POLCFG2</name>
                            <description>Comparator 2 Polarity Configure</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPTMRIN2_1</name>
                            <description>Comparator 2 LPTMR Input Configure</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPTMRIN2_2</name>
                            <description>Comparator 2 LPTMR Input Configure</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INPCCFG2</name>
                            <description>Comparator 2 Input Plus Connection Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INMCCFG2</name>
                            <description>Comparator 2 Input Minus Connection Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPEEDM2</name>
                            <description>Comparator 2 Speed Mode Select</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EN2</name>
                            <description>Comparator 2 enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
