frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32L0xx/APM32L08x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DBGMCU</name>
            <description>Debug support</description>
            <groupName>DBGMCU</groupName>
            <baseAddress>0x40015800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IDCODE</name>
                    <displayName>IDCODE</displayName>
                    <description>MCU Device ID Code Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EQR</name>
                            <description>Equipment Recognition</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>WVR</name>
                            <description>Wafer Version Recognition</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Debug MCU Configuration
          Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>SLEEP_CLK_STS</name>
                            <description>Configure clock status when MCU is debugged in sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STOP_CLK_STS</name>
                            <description>Configure clock status when MCU is debugged in stop mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STANDBY_CLK_STS</name>
                            <description>Configure clock status when MCU is debugged in standby mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB1F</name>
                    <displayName>APB1F</displayName>
                    <description>APB Low Freeze Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TMR2_STS</name>
                            <description>ConfigureTimer2 Work Status When Core is in Halted</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR3_STS</name>
                            <description>ConfigureTimer3 Work Status When Core is in Halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR6_STS</name>
                            <description>ConfigureTimer6 Work Status When Core is in Halted</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR7_STS</name>
                            <description>ConfigureTimer7 Work Status When Core is in Halted</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_STS</name>
                            <description>Configure RTC Work Status When Core is in Halted</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDT_STS</name>
                            <description>Configure Window Watchdog Work Status When Core is in Halted</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDT_STS</name>
                            <description>Configure Independent Watchdog Work Status When Core is in Halted</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1_SMBUS_TIMEOUT_STS</name>
                            <description>Configure I2C1_SMBUS_TIMEOUT Work Status When Core is in Halted</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C3_SMBUS_TIMEOUT_STS</name>
                            <description>Configure I2C3_SMBUS_TIMEOUT Work Status When Core is in Halted</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPTMR1_STS</name>
                            <description>Configure LPTMR1 Work Status When Core is in Halted</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB2F</name>
                    <displayName>APB2F</displayName>
                    <description>APB High Freeze Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TMR21_STS</name>
                            <description>ConfigureTimer21 Work Status When Core is in Halted</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR22_STS</name>
                            <description>ConfigureTimer22 Work Status When Core is in Halted</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
