frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32L0xx/APM32L08x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DMA</name>
            <description>Direct memory access controller</description>
            <groupName>DMA</groupName>
            <baseAddress>0x40020000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DMA_CH1</name>
                <description>DMA Channel1 global interrupt</description>
                <value>9</value>
            </interrupt>
            <interrupt>
                <name>DMA_CH2_3</name>
                <description>DMA Channel2 and 3 interrupts</description>
                <value>10</value>
            </interrupt>
            <interrupt>
                <name>DMA_CH4_5_6_7</name>
                <description>DMA Channel4 to 7 interrupts</description>
                <value>11</value>
            </interrupt>
            <registers>
                <register>
                    <name>INTSTS</name>
                    <displayName>INTSTS</displayName>
                    <description>interrupt status register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TERRFLG7</name>
                            <description>Channel x transfer error flag (x = 1
              ..7)</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTFLG7</name>
                            <description>Channel x half transfer flag (x = 1
              ..7)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCFLG7</name>
                            <description>Channel x transfer complete flag (x = 1
              ..7)</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTFLG7</name>
                            <description>Channel x global interrupt flag (x = 1
              ..7)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRFLG6</name>
                            <description>Channel x transfer error flag (x = 1
              ..7)</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTFLG6</name>
                            <description>Channel x half transfer flag (x = 1
              ..7)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCFLG6</name>
                            <description>Channel x transfer complete flag (x = 1
              ..7)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTFLG6</name>
                            <description>Channel x global interrupt flag (x = 1
              ..7)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRFLG5</name>
                            <description>Channel x transfer error flag (x = 1
              ..7)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTFLG5</name>
                            <description>Channel x half transfer flag (x = 1
              ..7)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCFLG5</name>
                            <description>Channel x transfer complete flag (x = 1
              ..7)</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTFLG5</name>
                            <description>Channel x global interrupt flag (x = 1
              ..7)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRFLG4</name>
                            <description>Channel x transfer error flag (x = 1
              ..7)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTFLG4</name>
                            <description>Channel x half transfer flag (x = 1
              ..7)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCFLG4</name>
                            <description>Channel x transfer complete flag (x = 1
              ..7)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTFLG4</name>
                            <description>Channel x global interrupt flag (x = 1
              ..7)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRFLG3</name>
                            <description>Channel x transfer error flag (x = 1
              ..7)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTFLG3</name>
                            <description>Channel x half transfer flag (x = 1
              ..7)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCFLG3</name>
                            <description>Channel x transfer complete flag (x = 1
              ..7)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTFLG3</name>
                            <description>Channel x global interrupt flag (x = 1
              ..7)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRFLG2</name>
                            <description>Channel x transfer error flag (x = 1
              ..7)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTFLG2</name>
                            <description>Channel x half transfer flag (x = 1
              ..7)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCFLG2</name>
                            <description>Channel x transfer complete flag (x = 1
              ..7)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTFLG2</name>
                            <description>Channel x global interrupt flag (x = 1
              ..7)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRFLG1</name>
                            <description>Channel x transfer error flag (x = 1
              ..7)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTFLG1</name>
                            <description>Channel x half transfer flag (x = 1
              ..7)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCFLG1</name>
                            <description>Channel x transfer complete flag (x = 1
              ..7)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTFLG1</name>
                            <description>Channel x global interrupt flag (x = 1
              ..7)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTFCLR</name>
                    <displayName>INTFCLR</displayName>
                    <description>interrupt flag clear register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TERRCLR7</name>
                            <description>Channel x transfer error clear (x = 1
              ..7)</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTCLR7</name>
                            <description>Channel x half transfer clear (x = 1
              ..7)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCCLR7</name>
                            <description>Channel x transfer complete clear (x = 1
              ..7)</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTCLR7</name>
                            <description>Channel x global interrupt clear (x = 1
              ..7)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRCLR6</name>
                            <description>Channel x transfer error clear (x = 1
              ..7)</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTCLR6</name>
                            <description>Channel x half transfer clear (x = 1
              ..7)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCCLR6</name>
                            <description>Channel x transfer complete clear (x = 1
              ..7)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTCLR6</name>
                            <description>Channel x global interrupt clear (x = 1
              ..7)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRCLR5</name>
                            <description>Channel x transfer error clear (x = 1
              ..7)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTCLR5</name>
                            <description>Channel x half transfer clear (x = 1
              ..7)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCCLR5</name>
                            <description>Channel x transfer complete clear (x = 1
              ..7)</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTCLR5</name>
                            <description>Channel x global interrupt clear (x = 1
              ..7)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRCLR4</name>
                            <description>Channel x transfer error clear (x = 1
              ..7)</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTCLR4</name>
                            <description>Channel x half transfer clear (x = 1
              ..7)</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCCLR4</name>
                            <description>Channel x transfer complete clear (x = 1
              ..7)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTCLR4</name>
                            <description>Channel x global interrupt clear (x = 1
              ..7)</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRCLR3</name>
                            <description>Channel x transfer error clear (x = 1
              ..7)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTCLR3</name>
                            <description>Channel x half transfer clear (x = 1
              ..7)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCCLR3</name>
                            <description>Channel x transfer complete clear (x = 1
              ..7)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTCLR3</name>
                            <description>Channel x global interrupt clear (x = 1
              ..7)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRCLR2</name>
                            <description>Channel x transfer error clear (x = 1
              ..7)</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTCLR2</name>
                            <description>Channel x half transfer clear (x = 1
              ..7)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCCLR2</name>
                            <description>Channel x transfer complete clear (x = 1
              ..7)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTCLR2</name>
                            <description>Channel x global interrupt clear (x = 1
              ..7)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRCLR1</name>
                            <description>Channel x transfer error clear (x = 1
              ..7)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTCLR1</name>
                            <description>Channel x half transfer clear (x = 1
              ..7)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCCLR1</name>
                            <description>Channel x transfer complete clear (x = 1
              ..7)</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GINTCLR1</name>
                            <description>Channel x global interrupt clear (x = 1
              ..7)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
