frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32L0xx/APM32L08x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>Firewall</name>
            <description>Firewall</description>
            <groupName>Firewall</groupName>
            <baseAddress>0x40011C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CSSTADD</name>
                    <displayName>CSSTADD</displayName>
                    <description>Code segment start address</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CSSTADD</name>
                            <description>code segment start address</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSL</name>
                    <displayName>CSL</displayName>
                    <description>Code segment length</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CSL</name>
                            <description>code segment length</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NVDSSTADD</name>
                    <displayName>NVDSSTADD</displayName>
                    <description>Non-volatile data segment start
          address</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NVDSSTADD</name>
                            <description>Non-volatile data segment start
              address</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NVDSL</name>
                    <displayName>NVDSL</displayName>
                    <description>Non-volatile data segment
          length</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NVDSL</name>
                            <description>Non-volatile data segment
              length</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VDSSTADD</name>
                    <displayName>VDSSTADD</displayName>
                    <description>Volatile data segment start
          address</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VDSSTADD</name>
                            <description>Volatile data segment start
              address</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VDSL</name>
                    <displayName>VDSL</displayName>
                    <description>Volatile data segment length</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VDSL</name>
                            <description>Non-volatile data segment
              length</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Configuration register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VDSE</name>
                            <description>Volatile Data Segment Execute</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VDSSHR</name>
                            <description>Volatile Data Segment Share</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CODESEL</name>
                            <description>Code Function Select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
